{
  "results": [
    {
      "title": "Dogs - petfinder.com",
      "description": "Everything you need to know about dogs, including dog breeds, how to adopt a dog, bringing a dog home, dog health and care, and more!",
      "url": "https://www.petfinder.com/dogs"
    },
    {
      "title": "Dog Breeds - Types Of Dogs - American Kennel Club",
      "description": "Affenpinscher. Loyal, curious, and famously amusing, this almost-human toy dog is fearless out … Afghan Hound. Among the most eye-catching of all dog breeds, the Afghan Hound is an aloof and … Airedale Terrier. His size, strength, and unflagging spirit have earned the Airedale Terrier the …Akita. Akita is muscular, double-coated dogs of ancient Japanese lineage famous for her dignity, …",
      "url": "https://www.akc.org/dog-breeds"
    },
    {
      "title": "List of Dog Breeds | Petfinder",
      "description": "Browse our list of 182 dog breeds to find the perfect dog breed for you, and then find adoptable dogs and dog shelters close to you.",
      "url": "https://www.petfinder.com/dog-breeds"
    },
    {
      "title": "Dogs | Animal Planet",
      "description": "From puppies to senior dogs, purebreed dogs to mutts and easy to train pets to bad dogs, check out our dog section for video, our dog breed selector and more.",
      "url": "www.animalplanet.com/pets/dogs"
    },
    {
      "title": "Town of North Hempstead - Dog Licenses",
      "description": "Our Government > Town Clerk > Dog Licenses > Dog Licenses Dog Licenses. The office of the Town Clerk is responsible for the licensing of all dogs in the Town as follows: ARTICLE 7 OF THE AGRICULTURE AND MARKETS LAW RELATES TO THE LICENSING, IDENTIFICATION AND CONTROL OF DOGS AND THE ANIMAL POPULATION CONTROL PROGRAM IN NEW YORK STATE AND IS …",
      "url": "https://northhempsteadny.gov/content/16253/16898/16905/default.aspx"
    },
    {
      "title": "Dogs for Sale in New York | Dogs on Oodle Classifieds",
      "description": "Find Dogs for Sale in New York on Oodle Classifieds. Join millions of people using Oodle to find puppies for adoption, dog and puppy listings, and other pets adoption. Don't miss what's happening in your neighborhood.",
      "url": "dogs.oodle.com › USA › NY"
    },
    {
      "title": "Complete Guide to Caring for Dogs | Dog Breed Information ...",
      "description": "Your dog's online owners manual, featuring articles about breed information, dog selection, training, grooming and care for dogs and puppies.",
      "url": "www.vetstreet.com/dogs"
    },
    {
      "title": "The Dogs of New York (@dogs_ny) • Instagram photos and videos",
      "description": "The Dogs of New York Capturing the hippest dogs in the world’s best city since 2013 🍏 🍎 🚕 🍕 🗽",
      "url": "https://www.instagram.com/dogs_ny"
    },
    {
      "title": "Dogs and Puppies for Sale and Adoption | Oodle Classifieds",
      "description": "Find puppies for sale and adoption, dogs for sale and adoption, labrador retrievers, german shepherds, yorkshire terriers, beagles, golden retrievers, bulldogs, boxers, dachshunds, poodles, shih tzus, rottweilers, miniature schnauzers, chihuahuas and more on Oodle Classifieds. Join millions of people using Oodle to find dogs and puppies for adoption and sale.",
      "url": "https://dogs.oodle.com"
    },
    {
      "title": "Local Dogs For Sale | Fetch Your New Best Friend",
      "description": "Get Healthy Pups From Responsible and Professional Breeders At PuppySpot. Find Your New Family Member Today, and Discover The PuppySpot Difference. Find the perfect puppy for your family. From breed selection to training to ... Only Responsible Breeders · Call Us 7 Days a Week · High Breeding Standards Types: Purebred Puppies, Designer Puppies, Responsible Breeders",
      "url": "https://www.puppyspot.com/dogs/in"
    }
  ]
}